# **Limpeza e preparação de dados**

## **Tratando de dados ausentes:**

In [1]:
import pandas as pd
import numpy as np

In [2]:
nomes = pd.Series(['Matheus', 'Dercy', np.nan, 'Sergio'])
nomes

0    Matheus
1      Dercy
2        NaN
3     Sergio
dtype: object

In [3]:
nomes.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
nomes[1] = None
nomes

0    Matheus
1       None
2        NaN
3     Sergio
dtype: object

**Obs: *None* em arrays de objetos é igual a NA**

In [5]:
nomes.isnull()

0    False
1     True
2     True
3    False
dtype: bool

### **Métodos para tratamento de NA**

In [6]:
nomes.notnull()

0     True
1    False
2    False
3     True
dtype: bool

In [7]:
nomes.fillna('Ercy')

0    Matheus
1       Ercy
2       Ercy
3     Sergio
dtype: object

In [8]:
nomes.dropna(inplace=False)

0    Matheus
3     Sergio
dtype: object

In [9]:
nomes

0    Matheus
1       None
2        NaN
3     Sergio
dtype: object

### **Tratando de dados ausentes:**

#### **Trabalhando com Series:**

In [10]:
from numpy import nan as NA
dados = pd.Series([3, NA, 5, NA, 9])
dados

0    3.0
1    NaN
2    5.0
3    NaN
4    9.0
dtype: float64

#####**OBS: dados.dropna() é igual a dados[dados.notnull()]**

In [11]:
dados.dropna()

0    3.0
2    5.0
4    9.0
dtype: float64

In [12]:
dados[dados.notnull()]

0    3.0
2    5.0
4    9.0
dtype: float64

#### **Trabalhando com DF**

In [13]:
data = pd.DataFrame([[4., 7.5, 3.], [2., NA, NA], [NA, NA, NA], [NA, 6.5, 8.]])
data

     0    1    2
0  4.0  7.5  3.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  8.0

#####**how='all' deleta os NaN do eixo inteiro passado apenas se todos os itens desse eixo forem NaN. Nesse caso, como eixo é zero, ele só deletou a coluna 2, cujo os itens eram todos NaN**

In [14]:
data.dropna(how='all')

     0    1    2
0  4.0  7.5  3.0
1  2.0  NaN  NaN
3  NaN  6.5  8.0

In [15]:
data[4] = NA
data

     0    1    2   4
0  4.0  7.5  3.0 NaN
1  2.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  8.0 NaN

In [16]:
data.dropna(how='all', axis=1)

     0    1    2
0  4.0  7.5  3.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  8.0

##### **O parâmetro thresh implica que no DF, no eixo selecionado (0 no caso) tem que no mínimo posssuir thresh valores não-NaN para o eixo continuar existindo**

In [17]:
data.dropna(thresh=2)

     0    1    2   4
0  4.0  7.5  3.0 NaN
3  NaN  6.5  8.0 NaN

#####**Dropna() elimina todas as linhas que tenham NaN presente:**

In [18]:
limpeza = data.dropna()
limpeza

Empty DataFrame
Columns: [0, 1, 2, 4]
Index: []

In [19]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df

          0         1         2
0  0.398486       NaN  0.672782
1 -0.190118       NaN -0.343754
2 -0.396518       NaN -1.097081
3 -1.361076       NaN  1.332961
4 -0.925764  1.531846  1.351268
5 -0.659810  0.699179 -0.269475
6 -0.190996  0.808712  1.504447

In [20]:
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.398486       NaN       NaN
1 -0.190118       NaN       NaN
2 -0.396518       NaN -1.097081
3 -1.361076       NaN  1.332961
4 -0.925764  1.531846  1.351268
5 -0.659810  0.699179 -0.269475
6 -0.190996  0.808712  1.504447

In [21]:
df.dropna()

          0         1         2
4 -0.925764  1.531846  1.351268
5 -0.659810  0.699179 -0.269475
6 -0.190996  0.808712  1.504447

### **Preenchendo dados ausentes:**

In [22]:
df.fillna(np.random.randint(0, 100))

          0          1          2
0  0.398486  89.000000  89.000000
1 -0.190118  89.000000  89.000000
2 -0.396518  89.000000  -1.097081
3 -1.361076  89.000000   1.332961
4 -0.925764   1.531846   1.351268
5 -0.659810   0.699179  -0.269475
6 -0.190996   0.808712   1.504447

In [23]:
df.fillna('Exemplo')

          0         1         2
0  0.398486   Exemplo   Exemplo
1 -0.190118   Exemplo   Exemplo
2 -0.396518   Exemplo  -1.09708
3 -1.361076   Exemplo   1.33296
4 -0.925764   1.53185   1.35127
5 -0.659810  0.699179 -0.269475
6 -0.190996  0.808712   1.50445

In [24]:
data.fillna(data.mean())

     0    1    2   4
0  4.0  7.5  3.0 NaN
1  2.0  7.0  5.5 NaN
2  3.0  7.0  5.5 NaN
3  3.0  6.5  8.0 NaN

#### **Obs: Se passar um dicionário no fillna, a key vira o número da coluna a ser preenchido, e o valor do dicionário vai ser o valor que vai ser preenchido na coluna determinada pela key do dicionário**

In [25]:
data.fillna({0:'Pares', 1: 'Quebrados', 2: 'Par Impar', 4: 'Ausentes'})

       0          1          2         4
0      4        7.5          3  Ausentes
1      2  Quebrados  Par Impar  Ausentes
2  Pares  Quebrados  Par Impar  Ausentes
3  Pares        6.5          8  Ausentes

## **Transformação de Dados:**

### **Removendo duplicatas:**

In [26]:
df2 = pd.DataFrame({'c1': ['um', 'dois'] * 3 + ['dois'], 'c2': [1, 1, 2, 3, 3, 4, 4]})
df2

     c1  c2
0    um   1
1  dois   1
2    um   2
3  dois   3
4    um   3
5  dois   4
6  dois   4

#### **Duplicated retorna uma Series booleana informando se o item é uma duplicata (Se foi repetido na linha anterior)**

In [27]:
df2.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
df2.drop_duplicates()

     c1  c2
0    um   1
1  dois   1
2    um   2
3  dois   3
4    um   3
5  dois   4

In [29]:
df2['c3'] = range(7)
df2

     c1  c2  c3
0    um   1   0
1  dois   1   1
2    um   2   2
3  dois   3   3
4    um   3   4
5  dois   4   5
6  dois   4   6

##### **Obs: Drop_duplicates por uma única coluna tira todas as duplicatas da coluna. Do contrário, retorna o resultado de duplicated()**

In [30]:
df2.drop_duplicates(['c1'], keep='last')

     c1  c2  c3
4    um   3   4
6  dois   4   6

In [31]:
df2.drop_duplicates(['c1', 'c2'])

     c1  c2  c3
0    um   1   0
1  dois   1   1
2    um   2   2
3  dois   3   3
4    um   3   4
5  dois   4   5

In [32]:
df2.drop_duplicates(['c1', 'c2'])

     c1  c2  c3
0    um   1   0
1  dois   1   1
2    um   2   2
3  dois   3   3
4    um   3   4
5  dois   4   5

### **Transformando dados através de mapeamento:**

In [33]:
comidas = pd.DataFrame({'comida': ['bacon', 'porco puxado', 'bacon', 'Pastrami', 'carne enlatada', 'Bacon',
                                   'pastrami', 'presunto de mel', 'salmao marinado'],
                                   'gramas': [113, 85, 12, 170, 212.62, 228, 85, 142, 170]})
comidas

            comida  gramas
0            bacon  113.00
1     porco puxado   85.00
2            bacon   12.00
3         Pastrami  170.00
4   carne enlatada  212.62
5            Bacon  228.00
6         pastrami   85.00
7  presunto de mel  142.00
8  salmao marinado  170.00

#### **Se eu quisesse criar uma nova coluna de animais baseado na comida, precisaria criar um dicionário da comida e do animal, depois mapear com os dados originais**

In [34]:
carne_animal = {
    'bacon': 'porco',
    'porco puxado': 'porco',
    'pastrami': 'vaca',
    'carne enlatada': 'vaca',
    'presunto de mel': 'porco',
    'salmao marinado': 'salmao'
}
carne_animal

{'bacon': 'porco',
 'carne enlatada': 'vaca',
 'pastrami': 'vaca',
 'porco puxado': 'porco',
 'presunto de mel': 'porco',
 'salmao marinado': 'salmao'}

In [35]:
comidas_minusculo = comidas['comida'].str.lower()
comidas_minusculo

0              bacon
1       porco puxado
2              bacon
3           pastrami
4     carne enlatada
5              bacon
6           pastrami
7    presunto de mel
8    salmao marinado
Name: comida, dtype: object

In [36]:
comidas['animais'] = comidas_minusculo.map(carne_animal)
comidas

            comida  gramas animais
0            bacon  113.00   porco
1     porco puxado   85.00   porco
2            bacon   12.00   porco
3         Pastrami  170.00    vaca
4   carne enlatada  212.62    vaca
5            Bacon  228.00   porco
6         pastrami   85.00    vaca
7  presunto de mel  142.00   porco
8  salmao marinado  170.00  salmao

### **Substituindo valores**

In [39]:
series = pd.Series([5., -999., 3, -999, -1000, 9])
series

0       5.0
1    -999.0
2       3.0
3    -999.0
4   -1000.0
5       9.0
dtype: float64

In [40]:
series.replace(-999, np.nan)

0       5.0
1       NaN
2       3.0
3       NaN
4   -1000.0
5       9.0
dtype: float64

#### **Para mais de um valor é necessário passar uma lista ou um dicionário**

In [41]:
series.replace([-999, -1000], np.nan)

0    5.0
1    NaN
2    3.0
3    NaN
4    NaN
5    9.0
dtype: float64

In [43]:
series.replace([-999, -1000], [15, np.nan])

0     5.0
1    15.0
2     3.0
3    15.0
4     NaN
5     9.0
dtype: float64

In [45]:
series.replace({-999:np.nan, -1000:'Mil negativo'})

0               5
1             NaN
2               3
3             NaN
4    Mil negativo
5               9
dtype: object